IDENTIFICATION DIVISION.
PROGRAM-ID. CUSTOMER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CUSTOMER-NAME    PIC    A(30).
01 CUSTOMER-AGE    PIC    99.
01 CUSTOMER-BALANCE    PIC    9(5)V99.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
      DISPLAY "Enter Customer Name: "
      ACCEPT CUSTOMER-NAME

      DISPLAY "Enter Customer Age: "
      ACCEPT CUSTOMER-AGE

      DISPLAY "Enter Customer Balance: "
      ACCEPT CUSTOMER-BALANCE

      DISPLAY "Customer Details:"
      DISPLAY "Name: " CUSTOMER-NAME
      DISPLAY "AGE: " CUSTOMER-AGE
      DISPLAY "Balance: " CUSTOMER-BALANCE

      STOP RUN.
