IDENTIFICATION DIVISION.
PROGRAM-ID. DECISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-AGE  PIC 99 VALUE 75.
01 WS-PREMIUM-TYPE    PIC X(10).

PROCEDURE DIVISION.
MAIN-PARA.
      
      IF WS-AGE < 18
       MOVE "NOT-ELIG" TO WS-PREMIUM-TYPE
      ELSE
       IF WS-AGE <= 60
           MOVE "NORMAL" TO WS-PREMIUM-TYPE
       ELSE
           MOVE "SENIOR" TO WS-PREMIUM-TYPE
       END-IF
      END-IF

      DISPLAY "AGE: " WS-AGE.
      DISPLAY "PREMIUM TYPE: " WS-PREMIUM-TYPE.

      STOP RUN.
