IDENTIFICATION DIVISION.
PROGRAM-ID. loop.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 UNTIL-COUNTER PIC 9 VALUE 1.
01 VARYING-COUNTER PIC 9 VALUE 1.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
      PERFORM LOOP-UNTIL
      PERFORM LOOP-VARYING
      STOP RUN.

LOOP-UNTIL.
      PERFORM UNTIL UNTIL-COUNTER > 5
       DISPLAY "UNTIL-COUNTER: " UNTIL-COUNTER
       ADD 1 TO UNTIL-COUNTER
      END-PERFORM.

LOOP-VARYING.
      PERFORM VARYING VARYING-COUNTER FROM 1 BY 1 UNTIL VARYING-COUNTER > 5
       DISPLAY "VARYING-COUNTER: " VARYING-COUNTER
      END-PERFORM.
