IDENTIFICATION DIVISION.
PROGRAM-ID. Array1.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 POLICY-TABLE.
      05 POLICY-ENTRY OCCURS 5 TIMES.
       10 POLICY-NUMBER PIC 9(6).
       10 PREMIUM PIC 9(5).

01 IDX PIC 9(2).

PROCEDURE DIVISION.
MAIN-PARA.
      PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 5
       MOVE IDX TO POLICY-NUMBER(IDX)
       COMPUTE PREMIUM(IDX) = IDX * 100
      END-PERFORM

      DISPLAY "------POLICY DATA------"

      PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 5
       DISPLAY "POLICY : " POLICY-NUMBER(IDX)
               " PREMIUM: " PREMIUM(IDX)
      END-PERFORM

      STOP RUN.
