IDENTIFICATION DIVISION.
PROGRAM-ID. POLICY.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 BASE-AMOUNT    PIC    9(7)V99.
01 RISK-PERCENT    PIC   99V99.
01 RISK-AMOUNT    PIC    9(7)V99.
01 TOTAL-PREMIUM    PIC    9(7)V99.

PROCEDURE DIVISION.
MAIN-PROCEDURE.

      DISPLAY "Enter Base Insurance Amount: "
      ACCEPT BASE-AMOUNT

      DISPLAY "Enter Risk Percentage (e.g. 05.50 for 5.5%): "
      ACCEPT RISK-PERCENT

      COMPUTE RISK-AMOUNT = BASE-AMOUNT * RISK-PERCENT / 100
      COMPUTE TOTAL-PREMIUM = BASE-AMOUNT + RISK-AMOUNT

      DISPLAY "-------------------------------"
      DISPLAY "Base Amount: " BASE-AMOUNT
      DISPLAY "RISK-AMOUNT: " RISK-AMOUNT
      DISPLAY "TOTAL-PREMIUM: " TOTAL-PREMIUM
      DISPLAY "-------------------------------"

      STOP RUN.


